app/controllers/home_controller.rb

  def show
    #@issue = Issue.find(params[:calificacion][:issue_id]) if params[:calificacion][:issue_id].size > 0
    if params[:calificacion][:issue_id].size > 0
      @issue = Issue.find(:first,
                        :conditions => ["id = ? AND status_id NOT IN (select id from issue_statuses where name in ('Cerrada', 'Calificada'))", params[:calificacion][:issue_id] ])
---
SELECT * FROM `calificacions` WHERE (`calificacions`.`issue_id` = 663) LIMIT 1
SELECT * FROM `issues` WHERE (id = '663' AND status_id NOT IN (select id from issue_statuses where name in ('Cerrada', 'Calificada'))) LIMIT 1

  def save
    #ip = request.env['REMOTE_ADDR']
    ip = request.env['HTTP_X_FORWARDED_FOR']
    @issue = Issue.find(params[:id])
    @calificacion ||= Calificacion.find_by_issue_id(@issue.id)
    @calificacion ||= Calificacion.new
    @calificacion.calificacion = params[:raiting].to_i if params[:raiting]
    @calificacion.update_attributes(params[:calificacion]) if @calificacion
    @calificacion.direccion_ip= ip if ip
    @calificacion.issue_id = @issue.id if @issue
    @calificacion.user_id = User.find(@issue.assigned_to_id).id if @issue
    if @calificacion.save
---
SELECT * FROM `issues` WHERE (`issues`.`id` = 663)
SELECT * FROM `calificacions` WHERE (`calificacions`.`issue_id` = 663) LIMIT 1
UPDATE `calificacions` SET `updated_at` = '2013-10-07 16:59:50', `direccion_ip` = '127.0.0.1', `issue_id` = 1, `user_id` = 25 WHERE `id` = 3
SELECT * FROM `users` WHERE (`users`.`id` = 25)
INSERT INTO `calificacions` (`direccion_ip`, `created_at`, `cumplio_expectativas`, `nombre`, `issue_id`, `calificacion`, `updated_at`, `observaciones`, `user_id`) VALUES(NULL, '2013-10-07 16:47:18', NULL, NULL, NULL, NULL, '2013-10-07 16:47:18', NULL, NULL)